Enterprise_Serivces/Prod/Bronze4/ReservationService/result1/Iteration1/t1_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><CorrelationID xmlns="http://services.gamestop.com/sales/reservation/reservationservice/v1.0">238fd695-a962-4006-8483-7e3fbe2e8259</CorrelationID><MachineName xmlns="http://services.gamestop.com/sales/reservation/reservationservice/v1.0">test</MachineName><wsa:Action>http://services.gamestop.com/sales/reservation/reservationservice/v1.0/IReservationService/AddDeposit</wsa:Action><wsa:MessageID>uuid:f2b2e90c-e4ca-4545-bce0-17e5736bc589</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslreservationserviceqa1.testgs.pvt/ReservationService.svc</wsa:To></soap:Header><soap:Body><AddDepositRequest xmlns="http://services.gamestop.com/sales/reservation/reservationservice/v1.0"><DepositAmount>5</DepositAmount><OrderReferenceNumber>33693832410462</OrderReferenceNumber></AddDepositRequest></soap:Body></soap:Envelope>